<%@ page language="java" pageEncoding="UTF-8"%><%@ taglib uri="http://java.sun.com/jsp/jstl/core" prefix="c"%><%@ taglib prefix="fmt" uri="http://java.sun.com/jsp/jstl/fmt"%><%@ taglib prefix="fn" uri="http://java.sun.com/jsp/jstl/functions"%><%@ taglib uri="/WEB-INF/waphk.tld" prefix="hk"%><hk:wap title="火酷使用协议 - 火酷" rm="false" bodyId="thepage">
	<jsp:include page="../inc/top.jsp"></jsp:include>
	<div class="hang">
	5　用户帐号、密码及安全<br/>
　　完成本服务的注册程序并成功注册之后，您可使用您的Email和密码，登陆到您在火酷的帐号（下称“帐号”）。保护您的帐号安全，是您的责任。<br/>
　　您应对所有使用您的密码及帐号的活动负完全的责任。您同意：<br/>
　　1）您的火酷帐号遭到未获授权的使用，或者发生其它任何安全问题时，您将立即通知火酷；<br/>
　　2）如果您未保管好自己的帐号和密码，因此而产生的任何损失或损害，火酷无法也不承担任何责任；<br/>
　　3）每个用户都要对其帐号中的所有行为和事件负全责。如果您未保管好自己的帐号和密码而对您、火酷或第三方造成的损害，您将负全部责任。<br/>
	6　火酷隐私权政策<br/>
　　您提供的登记资料及火酷保留的有关您的若干其它资料将受到中国有关隐私的法律和本公司《隐私声明》之规范。<br/>
	7　提供者之责任<br/>
　　根据有关法律法规，火酷在此郑重提请您注意，任何经由本服务而发布、上传的文字、资讯、资料、音乐、照片、图形、视讯、信息或其它资料（以下简称“内容 ”），无论系公开还是私下传送，均由内容提供者承担责任。火酷仅为用户提供内容存储空间，无法控制经由本服务传送之内容，因此不保证内容的正确性、完整性或品质。您已预知使用本服务时，可能会接触到令人不快、不适当或令人厌恶之内容。在任何情况下，火酷均不为任何内容负责，但火酷有权依法停止传输任何前述内容并采取相应行动，包括但不限于暂停用户使用本服务的全部或部分，保存有关记录，并向有关机关报告。<br/>
	8　用户行为<br/>
　　用户同意将不会利用本服务进行任何违法或不正当的活动，包括但不限于下列行为∶<br/>
　　1）发布或以其它方式传送含有下列内容之一的信息：<br/>
　　　* 反对宪法所确定的基本原则的；<br/>
　　　* 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；<br/>
　　　* 损害国家荣誉和利益的；<br/>
　　　* 煽动民族仇恨、民族歧视、破坏民族团结的；<br/>
　　　* 破坏国家宗教政策，宣扬邪教和封建迷信的；<br/>
　　　* 散布谣言，扰乱社会秩序，破坏社会稳定的；<br/>
　　　* 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；<br/>
　　　* 侮辱或者诽谤他人，侵害他人合法权利的；<br/>
　　　* 含有虚假、诈骗、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感的内容；<br/>
　　　* 含有中国法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容的；<br/>
	 *含有火酷认为不适合在火酷展示的内容；<br/>
	</div>
	<div class="hang"><hk:a href="/pub/xieyi_p1.do?inviteCode=${inviteCode}">上一页</hk:a></div>
	<div class="hang"><hk:a href="/pub/xieyi_p3.do?inviteCode=${inviteCode}">下一页</hk:a></div>
	<div class="hang"><hk:a href="/reg_toreg.do?inviteCode=${inviteCode}">返回</hk:a></div>
	<jsp:include page="../inc/foot.jsp"></jsp:include>
</hk:wap>