<%@ page language="java" pageEncoding="UTF-8"%><%@ taglib uri="http://java.sun.com/jsp/jstl/core" prefix="c"%><%@ taglib prefix="fmt" uri="http://java.sun.com/jsp/jstl/fmt"%><%@ taglib prefix="fn" uri="http://java.sun.com/jsp/jstl/functions"%><%@ taglib uri="/WEB-INF/waphk.tld" prefix="hk"%><hk:wap title="火酷使用协议 - 火酷" rm="false" bodyId="thepage">
	<jsp:include page="../inc/top.jsp"></jsp:include>
	<div class="hang">
	16　与广告商及其他第三方进行交易<br/>
	　　您通过本网站与广告商及其他第三方进行任何形式的通讯或商业往来，或参与促销活动，包含相关商品或服务之付款及交付，以及达成的其它任何相关条款、条件、保证或声明，完全为您与广告商及其他第三方之间之行为。您因前述任何交易或前述广告商及其他第三方而遭受的任何性质的损失或损害，火酷对此不负任何法律责任。<br/>
	17　火酷之专属权利<br/>
	　　您了解并同意，本服务及本服务所使用之相关软件（以下简称“软件”）含有受到相关知识产权及其它法律保护之专有保密资料。您也了解并同意，经由本服务或广告商向您呈现之赞助广告或信息所包含之内容，亦受到著作权、商标权、服务商标、专利权或其它专属权利之法律保护。未经火酷或广告商明示授权，您不得修改、出租、出借、出售、散布本服务或软件之任何部份或全部，或据以制作衍生著作，或使用擅自修改后的软件，包括但不限于为了未经授权而使用本服务之目的。火酷仅授予您个人、不可移转及非专属之使用权，使您得于单机计算机使用其软件之目的码，但您不得（并不得允许任何第三人）复制、修改、创作衍生著作、进行还原工程、反向组译，或以其它方式发现原始码，或出售、转让、再授权或提供软件设定担保，或以其它方式移转软件之任何权利。您同意将通过由火酷所提供的界面而非任何其它途径使用本服务。<br/>
	18　担保与保证<br/>
	　　您明确了解并同意∶<br/>
	　　1）本使用协议的任何规定不会免除火酷对造成您人身伤害的、或因故意或重大过失造成您财产损失的任何责任；<br/>
	　　2）您使用本服务之风险由您个人负担。本服务系依“现状”及“现有”基础提供。火酷对本服务不提供任何明示或默示的担保或保证，包含但不限于商业适售性、特定目的之适用性及未侵害他人权利等担保或保证；<br/>
	　　3）火酷不保证以下事项∶<br/>
	　　　* 本服务将符合您的要求；<br/>
	　　　* 本服务将不受干扰、及时提供、安全可靠或不会出错；<br/>
	　　　* 使用本服务取得之结果正确可靠；<br/>
	　　　* 您经由本服务购买或取得之任何产品、服务、资讯或其它信息将符合您的期望；<br/>
	　　4）是否使用本服务下载或取得任何资料应由您自行考虑且自负风险，因任何资料之下载而导致的您电脑系统之任何损坏或数据流失等后果，由您自行承担<br/>；
	　　5）您自火酷或经由本服务取得的任何建议或信息，无论是书面或口头形式，除非本使用协议有明确规定，将不构成本使用协议以外之任何保证。<br/>
	19　责任限制<br/>
	</div>
	<div class="hang"><hk:a href="/pub/xieyi_p3.do?inviteCode=${inviteCode}">上一页</hk:a></div>
	<div class="hang"><hk:a href="/pub/xieyi_p6.do?inviteCode=${inviteCode}">下一页</hk:a></div>
	<div class="hang"><hk:a href="/reg_toreg.do?inviteCode=${inviteCode}">返回</hk:a></div>
	<jsp:include page="../inc/foot.jsp"></jsp:include>
</hk:wap>