<%@ page language="java" pageEncoding="UTF-8"%><%@ taglib uri="http://java.sun.com/jsp/jstl/core" prefix="c"%><%@ taglib prefix="fmt" uri="http://java.sun.com/jsp/jstl/fmt"%><%@ taglib prefix="fn" uri="http://java.sun.com/jsp/jstl/functions"%><%@ taglib uri="/WEB-INF/waphk.tld" prefix="hk"%><hk:wap title="火酷使用协议 - 火酷" rm="false" bodyId="thepage">
	<jsp:include page="../inc/top.jsp"></jsp:include>
	<div class="hang">
	10　在火酷发布的公开信息<br/>
	　　1）在本使用协议中，“本服务公开使用区域”系指一般公众可以使用的区域；<br/>
	　　2）用户在火酷上传或发布的内容，用户应保证其为著作权人或已取得合法授权，并且该内容不会侵犯任何第三方的合法权益，用户同意授予火酷所有上述内容在全球范围内的免费、不可撤销的、永久的、可再许可或转让的独家使用权许可，据该许可火酷将有权以展示、推广及其他不为我法律所禁止的方式使用前述内容。<br/>
	11　赔偿<br/>
	　　由于您通过本服务提供、发布或传送之内容、您与本服务连线、您违反本使用协议、或您侵害他人任何权利因而衍生或导致任何第三人提出任何索赔或请求，包括合理的律师费，您同意赔偿火酷及其子公司、关联企业、高级职员、代理人、品牌共有人或其它合作伙伴及员工，并使其免受损害，并承担由此引发的全部法律责任。<br/>
	12　关于使用及储存之一般措施<br/>
	　　您同意不对本服务任何部分或本服务之使用或获得，进行复制、拷贝、出售、转售或用于任何其它商业目的。<br/>
	13　关于使用及储存之一般措施<br/>
	　　您承认关于本服务的使用火酷有权制订一般措施及限制，包含但不限于本服务将保留所发布内容或其它发布内容之最长期间，以及一定期间内您使用本服务之次数上限（及每次使用时间之上限）。通过本服务发布或传送之任何信息、通讯资料和其它内容，如被删除或未予储存，您同意火酷毋须承担任何责任。您也同意，火酷有权依其自行之考虑，不论通知与否，随时变更这些一般措施及限制。<br/>
	14　服务之修改<br/>
	　　火酷有权于任何时间暂时或永久修改或终止本服务（或其任何部分），且无论通知与否。您同意对于本服务所作的任何修改、暂停或终止，火酷对您和任何第三人均无需承担任何责任。<br/>
	15　终止服务<br/>
	　　您同意火酷基于其自行之考虑，因任何理由，包含但不限于缺乏使用，或火酷认为您已经违反本使用协议的文字及精神，终止您的帐号或本服务之使用（或服务之任何部分），并将您在本服务内任何内容加以移除并删除。您同意依本使用协议任何规定提供之本服务，无需进行事先通知即可中断或终止，您承认并同意，火酷可立即关闭或删除您的帐号及您帐号中所有相关信息及文件，及/或禁止继续使用前述文件或本服务。此外，您同意若本服务之使用被中断或终止或您的帐号及相关信息和文件被关闭或删除，火酷对您或任何第三人均不承担任何责任。<br/>
	</div>
	<div class="hang"><hk:a href="/pub/xieyi_p3.do?inviteCode=${inviteCode}">上一页</hk:a></div>
	<div class="hang"><hk:a href="/pub/xieyi_p5.do?inviteCode=${inviteCode}">下一页</hk:a></div>
	<div class="hang"><hk:a href="/reg_toreg.do?inviteCode=${inviteCode}">返回</hk:a></div>
	<jsp:include page="../inc/foot.jsp"></jsp:include>
</hk:wap>