<%@ page language="java" pageEncoding="UTF-8"%><%@ taglib uri="http://java.sun.com/jsp/jstl/core" prefix="c"%><%@ taglib prefix="fmt" uri="http://java.sun.com/jsp/jstl/fmt"%><%@ taglib prefix="fn" uri="http://java.sun.com/jsp/jstl/functions"%><%@ taglib uri="/WEB-INF/waphk.tld" prefix="hk"%><hk:wap title="火酷使用协议 - 火酷" rm="false" bodyId="thepage">
	<jsp:include page="../inc/top.jsp"></jsp:include>
	<div class="hang">
		1　接受条款<br/>
	　　火酷网（以下简称“火酷”）根据以下服务条款为您提供服务。这些条款可由火酷随时更新，且毋须另行通知。火酷使用协议（以下简称“使用协议”）一旦发生变动，火酷将在网页上公布修改内容。修改后的使用协议一旦在网页上公布即有效代替原来的使用协议。此外，当您使用火酷特殊服务时，您和火酷应遵守火酷随时公布的与该服务相关的指引和规则。前述所有的指引和规则，均构成本使用协议的一部分。<br/>
	　　您在使用火酷提供的各项服务之前，应仔细阅读本使用协议。如您不同意本使用协议及/或随时对其的修改，请您立即停止使用火酷网所提供的全部服务；您一旦使用火酷服务，即视为您已了解并完全同意本使用协议各项内容，包括火酷对使用协议随时所做的任何修改，并成为火酷用户（以下简称“用户”）。<br/>
		2　服务说明<br/>
	　　火酷目前向用户提供如下服务：在火酷中发布小喇叭；在火酷中参与开箱活动，点评企业服务和预订企业服务。除非本使用协议另有其它明示规定，增加或强化目前本服务的任何新功能，包括所推出的新产品，均受到本使用协议之规范。您了解并同意，本服务仅依其当前所呈现的状况提供，对于任何用户信息或个人化设定之时效、删除、传递错误、未予储存或其它任何问题，火酷均不承担任何责任。火酷保留不经事先通知为维修保养、升级或其它目的暂停本服务任何部分的权利。<br/>
		3　遵守法律<br/>
	　　您同意遵守中华人民共和国相关法律法规的所有规定，并对以任何方式使用您的密码和您的帐号使用本服务的任何行为及其结果承担全部责任。如您的行为违反国家法律和法规的任何规定，有可能构成犯罪的，将被追究刑事责任，并由您承担全部法律责任。<br/>
	　　同时如果火酷有理由认为您的任何行为，包括但不限于您的任何言论和其它行为违反或可能违反国家法律和法规的任何规定，火酷可在任何时候不经任何事先通知终止向您提供服务。<br/>
		4　您的注册义务<br/>
	　　为了能使用本服务，您同意以下事项：依本服务注册提示请您填写正确的注册邮箱、密码、手机号和昵称，并确保今后更新的登陆邮箱、昵称、头像等资料的有效性和合法性。若您提供任何违法、不道德或火酷认为不适合在火酷上展示的资料；或者火酷有理由怀疑你的资料属于程序或恶意操作，火酷有权暂停或终止您的帐号，并拒绝您于现在和未来使用本服务之全部或任何部分。<br/>
	　　火酷无须对任何用户的任何登记资料承担任何责任，包括但不限于鉴别、核实任何登记资料的真实性、正确性、完整性、适用性及/或是否为最新资料的责任。<br/>
	</div>
	<div class="hang"><hk:a href="/pub/xieyi_p2.do?inviteCode=${inviteCode}">下一页</hk:a></div>
	<div class="hang"><hk:a href="/reg_toreg.do?inviteCode=${inviteCode}">返回</hk:a></div>
	<jsp:include page="../inc/foot.jsp"></jsp:include>
</hk:wap>