-- MySQL dump 10.11
--
-- Host: localhost    Database: iwant
-- ------------------------------------------------------
-- Server version	5.0.51a-community-nt

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `country`
--

DROP TABLE IF EXISTS `country`;
SET @saved_cs_client     = @@character_set_client;
SET character_set_client = utf8;
CREATE TABLE `country` (
  `countryid` int(10) unsigned NOT NULL auto_increment,
  `name` varchar(50) default NULL,
  PRIMARY KEY  USING BTREE (`countryid`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;
SET character_set_client = @saved_cs_client;

--
-- Dumping data for table `country`
--

LOCK TABLES `country` WRITE;
/*!40000 ALTER TABLE `country` DISABLE KEYS */;
INSERT INTO `country` VALUES (1,'中国');
/*!40000 ALTER TABLE `country` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `city`
--

DROP TABLE IF EXISTS `city`;
SET @saved_cs_client     = @@character_set_client;
SET character_set_client = utf8;
CREATE TABLE `city` (
  `cityid` int(10) unsigned NOT NULL auto_increment,
  `countryid` int(10) unsigned NOT NULL default '0',
  `provinceid` int(10) unsigned NOT NULL default '0',
  `name` varchar(50) default NULL,
  PRIMARY KEY  USING BTREE (`cityid`)
) ENGINE=InnoDB AUTO_INCREMENT=674 DEFAULT CHARSET=utf8;
SET character_set_client = @saved_cs_client;

--
-- Dumping data for table `city`
--

LOCK TABLES `city` WRITE;
/*!40000 ALTER TABLE `city` DISABLE KEYS */;
INSERT INTO `city` VALUES (76,1,5,'南京'),(77,1,5,'常熟'),(78,1,5,'常州'),(79,1,5,'海门'),(80,1,5,'淮安'),(81,1,5,'江都'),(82,1,5,'江阴'),(83,1,5,'昆山'),(84,1,5,'连云港'),(85,1,5,'南通'),(86,1,5,'启东'),(87,1,5,'沭阳'),(88,1,5,'宿迁'),(89,1,5,'苏州'),(90,1,5,'太仓'),(91,1,5,'泰州'),(92,1,5,'同里'),(93,1,5,'无锡'),(94,1,5,'徐州'),(95,1,5,'盐城'),(96,1,5,'扬州'),(97,1,5,'宜兴'),(98,1,5,'仪征'),(99,1,5,'张家港'),(100,1,5,'镇江'),(101,1,5,'周庄'),(102,1,6,'石家庄'),(103,1,6,'保定'),(104,1,6,'北戴河'),(105,1,6,'沧州'),(106,1,6,'承德'),(107,1,6,'丰润'),(108,1,6,'邯郸'),(109,1,6,'衡水'),(110,1,6,'廊坊'),(111,1,6,'南戴河'),(112,1,6,'秦皇岛唐山'),(113,1,6,'新城'),(114,1,6,'邢台'),(115,1,6,'张家口'),(116,1,8,'呼和浩特'),(117,1,8,'阿拉善盟'),(118,1,8,'包头'),(119,1,8,'赤峰'),(120,1,8,'东胜'),(121,1,8,'海拉尔'),(122,1,8,'集宁'),(123,1,8,'临河'),(124,1,8,'通辽'),(125,1,8,'乌海'),(126,1,8,'乌兰浩特'),(127,1,8,'锡林浩特'),(128,1,8,'巴彦浩特'),(129,1,9,'太原'),(130,1,9,'长治'),(131,1,9,'大同'),(132,1,9,'候马'),(133,1,9,'晋城'),(134,1,9,'离石'),(135,1,9,'临汾'),(136,1,9,'宁武'),(137,1,9,'朔州'),(138,1,9,'忻州'),(139,1,9,'阳泉'),(140,1,9,'榆次'),(141,1,9,'运城'),(142,1,10,'济南'),(143,1,10,'青岛'),(144,1,10,'淄博'),(145,1,10,'烟台'),(146,1,10,'潍坊'),(147,1,10,'威海'),(148,1,10,'济宁'),(149,1,10,'莱芜'),(150,1,10,'聊城'),(151,1,10,'兖州'),(152,1,10,'德州'),(153,1,10,'东营'),(154,1,10,'菏泽'),(155,1,10,'临沂'),(156,1,10,'蓬莱'),(157,1,10,'滨州'),(158,1,10,'曲阜'),(159,1,10,'日照'),(160,1,10,'泰安'),(161,1,10,'枣庄'),(162,1,11,'合肥'),(163,1,11,'安庆'),(164,1,11,'蚌埠'),(165,1,11,'亳州'),(166,1,11,'巢湖'),(167,1,11,'滁州'),(168,1,11,'阜阳'),(169,1,11,'贵池'),(170,1,11,'淮北'),(171,1,11,'淮化'),(172,1,11,'淮南'),(173,1,11,'黄山'),(174,1,11,'九华山'),(175,1,11,'六安'),(176,1,11,'马鞍山'),(177,1,11,'宿州'),(178,1,11,'铜陵'),(179,1,11,'屯溪'),(180,1,11,'芜湖'),(181,1,11,'宣城'),(182,1,12,'福州'),(183,1,12,'福安'),(184,1,12,'龙岩'),(185,1,12,'南平'),(186,1,12,'宁德'),(187,1,12,'莆田'),(188,1,12,'泉州'),(189,1,12,'三明'),(190,1,12,'邵武'),(191,1,12,'石狮'),(192,1,12,'永安'),(193,1,12,'武夷山'),(194,1,12,'厦门'),(195,1,12,'漳州'),(196,1,13,'南昌'),(197,1,13,'抚州'),(198,1,13,'赣州'),(199,1,13,'吉安'),(200,1,13,'景德镇'),(201,1,13,'井冈山'),(202,1,13,'九江'),(203,1,13,'庐山'),(204,1,13,'萍乡'),(205,1,13,'上饶'),(206,1,13,'新余'),(207,1,13,'宜春'),(208,1,13,'鹰潭'),(209,1,14,'杭州'),(210,1,14,'安吉'),(211,1,14,'慈溪'),(212,1,14,'定海'),(213,1,14,'奉化'),(214,1,14,'海盐'),(215,1,14,'黄岩'),(216,1,14,'湖州'),(217,1,14,'嘉兴'),(218,1,14,'金华'),(219,1,14,'临安'),(220,1,14,'临海'),(221,1,14,'丽水'),(222,1,14,'宁波'),(223,1,14,'瓯海'),(224,1,14,'平湖'),(225,1,14,'千岛湖'),(226,1,14,'衢州'),(227,1,14,'江山'),(228,1,14,'瑞安'),(229,1,14,'绍兴'),(230,1,14,'嵊州'),(231,1,14,'台州'),(232,1,14,'温岭'),(233,1,14,'温州'),(234,1,14,'舟山'),(235,1,15,'郑州'),(236,1,15,'安阳'),(237,1,15,'鹤壁'),(238,1,15,'潢川'),(239,1,15,'焦作'),(240,1,15,'济源'),(241,1,15,'开封'),(242,1,15,'漯河'),(243,1,15,'洛阳'),(244,1,15,'南阳'),(245,1,15,'平顶山'),(246,1,15,'濮阳'),(247,1,15,'三门峡'),(248,1,15,'商丘'),(249,1,15,'新乡'),(250,1,15,'信阳'),(251,1,15,'许昌'),(252,1,15,'周口'),(253,1,15,'驻马店'),(254,1,16,'武汉'),(255,1,16,'恩施'),(256,1,16,'鄂州'),(257,1,16,'黄冈'),(258,1,16,'黄石'),(259,1,16,'荆门'),(260,1,16,'荆州'),(261,1,16,'潜江'),(262,1,16,'十堰'),(263,1,16,'随州'),(264,1,16,'武穴'),(265,1,16,'仙桃'),(266,1,16,'咸宁'),(267,1,16,'襄阳'),(268,1,16,'襄樊'),(269,1,16,'孝感'),(270,1,16,'宜昌'),(271,1,17,'长沙'),(272,1,17,'常德'),(273,1,17,'郴州'),(274,1,17,'衡阳'),(275,1,17,'怀化'),(276,1,17,'吉首'),(277,1,17,'娄底'),(278,1,17,'邵阳'),(279,1,17,'湘潭'),(280,1,17,'益阳'),(281,1,17,'岳阳'),(282,1,17,'永州'),(283,1,17,'张家界'),(284,1,17,'株洲'),(285,1,18,'广州'),(286,1,18,'潮阳'),(287,1,18,'潮州'),(288,1,18,'澄海'),(289,1,18,'东莞'),(290,1,18,'佛山'),(291,1,18,'河源'),(292,1,18,'惠州'),(293,1,18,'江门'),(294,1,18,'揭阳'),(295,1,18,'开平'),(296,1,18,'茂名'),(297,1,18,'梅州'),(298,1,18,'清远'),(299,1,18,'汕头'),(300,1,18,'汕尾'),(301,1,18,'韶关'),(302,1,18,'深圳'),(303,1,18,'顺德'),(304,1,18,'阳江'),(305,1,18,'英德'),(306,1,18,'云浮'),(307,1,18,'增城'),(308,1,18,'湛江'),(309,1,18,'肇庆'),(310,1,18,'中山'),(311,1,18,'珠海'),(312,1,19,'南宁'),(313,1,19,'百色'),(314,1,19,'北海'),(315,1,19,'桂林'),(316,1,19,'防城港'),(317,1,19,'河池'),(318,1,19,'贺州'),(319,1,19,'柳州'),(320,1,19,'钦州'),(321,1,19,'梧州'),(322,1,19,'玉林'),(323,1,20,'海口'),(324,1,20,'儋县'),(325,1,20,'陵水'),(326,1,20,'琼海'),(327,1,20,'三亚'),(328,1,20,'通什'),(329,1,20,'万宁'),(330,1,21,'哈尔滨'),(331,1,21,'北安'),(332,1,21,'大庆'),(333,1,21,'大兴安岭'),(334,1,21,'鹤岗'),(335,1,21,'黑河'),(336,1,21,'佳木斯'),(337,1,21,'鸡西'),(338,1,21,'牡丹江'),(339,1,21,'齐齐哈尔'),(340,1,21,'七台河'),(341,1,21,'双鸭山'),(342,1,21,'绥化'),(343,1,21,'伊春'),(344,1,22,'长春'),(345,1,22,'白城'),(346,1,22,'白山'),(347,1,22,'珲春'),(348,1,22,'辽源'),(349,1,22,'梅河'),(350,1,22,'吉林'),(351,1,22,'四平'),(352,1,22,'松原'),(353,1,22,'通化'),(354,1,22,'延吉'),(355,1,23,'沈阳'),(356,1,23,'鞍山'),(357,1,23,'本溪'),(358,1,23,'朝阳'),(359,1,23,'大连'),(360,1,23,'丹东'),(361,1,23,'抚顺'),(362,1,23,'阜新'),(363,1,23,'葫芦岛'),(364,1,23,'锦州'),(365,1,23,'辽阳'),(366,1,23,'盘锦'),(367,1,23,'铁岭'),(368,1,23,'营口'),(369,1,24,'兰州'),(370,1,24,'白银'),(371,1,24,'定西'),(372,1,24,'敦煌'),(373,1,24,'甘南'),(374,1,24,'金昌'),(375,1,24,'酒泉'),(376,1,24,'临夏'),(377,1,24,'平凉'),(378,1,24,'天水'),(379,1,24,'武都'),(380,1,24,'武威'),(381,1,24,'西峰'),(382,1,24,'张掖'),(383,1,25,'银川'),(384,1,25,'固原'),(385,1,25,'石嘴山'),(386,1,25,'吴忠'),(387,1,26,'西宁'),(388,1,26,'德令哈'),(389,1,26,'格尔木'),(390,1,26,'共和'),(391,1,26,'海东'),(392,1,26,'海晏'),(393,1,26,'玛沁'),(394,1,26,'同仁'),(395,1,26,'玉树'),(396,1,27,'西安'),(397,1,27,'安康'),(398,1,27,'宝鸡'),(399,1,27,'汉中'),(400,1,27,'渭南'),(401,1,27,'商州'),(402,1,27,'绥德'),(403,1,27,'铜川'),(404,1,27,'咸阳'),(405,1,27,'延安'),(406,1,27,'榆林'),(407,1,28,'乌鲁木齐'),(408,1,28,'阿克苏'),(409,1,28,'阿勒泰'),(410,1,28,'阿图什'),(411,1,28,'博乐'),(412,1,28,'昌吉'),(413,1,28,'东山'),(414,1,28,'哈密'),(415,1,28,'和田'),(416,1,28,'喀什'),(417,1,28,'克拉玛依'),(418,1,28,'库车'),(419,1,28,'库尔勒'),(420,1,28,'奎屯'),(421,1,28,'石河子'),(422,1,28,'塔城'),(423,1,28,'吐鲁番'),(424,1,28,'伊宁'),(425,1,30,'贵阳'),(426,1,30,'安顺'),(427,1,30,'毕节'),(428,1,30,'都匀'),(429,1,30,'凯里'),(430,1,30,'六盘水'),(431,1,30,'铜仁'),(432,1,30,'兴义'),(433,1,30,'玉屏'),(434,1,30,'遵义'),(435,1,31,'成都'),(436,1,31,'巴中'),(437,1,31,'达州'),(438,1,31,'德阳'),(439,1,31,'都江堰'),(440,1,31,'峨眉山'),(441,1,31,'涪陵'),(442,1,31,'广安'),(443,1,31,'广元'),(444,1,31,'九寨沟'),(445,1,31,'康定'),(446,1,31,'乐山'),(447,1,31,'泸州'),(448,1,31,'马尔康'),(449,1,31,'绵阳'),(450,1,31,'眉山'),(451,1,31,'南充'),(452,1,31,'内江'),(453,1,31,'攀枝花'),(454,1,31,'遂宁'),(455,1,31,'汶川'),(456,1,31,'西昌'),(457,1,31,'雅安'),(458,1,31,'宜宾'),(459,1,31,'自贡'),(460,1,31,'资阳'),(461,1,32,'拉萨'),(462,1,32,'阿里'),(463,1,32,'昌都'),(464,1,32,'林芝'),(465,1,32,'那曲'),(466,1,32,'日喀则'),(467,1,32,'山南'),(468,1,33,'昆明'),(469,1,33,'大理'),(470,1,33,'保山'),(471,1,33,'楚雄'),(472,1,33,'东川'),(473,1,33,'个旧'),(474,1,33,'景洪'),(475,1,33,'开远'),(476,1,33,'临沧'),(477,1,33,'丽江'),(478,1,33,'六库'),(479,1,33,'潞西'),(480,1,33,'曲靖'),(481,1,33,'思茅'),(482,1,33,'文山'),(483,1,33,'西双版纳'),(484,1,33,'玉溪'),(485,1,33,'中甸'),(486,1,33,'昭通'),(487,1,34,'香港'),(488,1,34,'九龙'),(489,1,34,'新界'),(490,1,35,'台北'),(491,1,35,'基隆'),(492,1,35,'台南'),(493,1,35,'台中'),(494,1,36,'澳门'),(495,1,6,'唐山'),(575,1,1,'北京'),(576,1,2,'上海市'),(577,1,4,'天津市'),(578,1,3,'重庆');
/*!40000 ALTER TABLE `city` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `province`
--

DROP TABLE IF EXISTS `province`;
SET @saved_cs_client     = @@character_set_client;
SET character_set_client = utf8;
CREATE TABLE `province` (
  `provinceid` int(10) unsigned NOT NULL auto_increment,
  `countryid` int(10) unsigned NOT NULL default '0',
  `name` varchar(50) default NULL,
  PRIMARY KEY  USING BTREE (`provinceid`)
) ENGINE=InnoDB AUTO_INCREMENT=111 DEFAULT CHARSET=utf8;
SET character_set_client = @saved_cs_client;

--
-- Dumping data for table `province`
--

LOCK TABLES `province` WRITE;
/*!40000 ALTER TABLE `province` DISABLE KEYS */;
INSERT INTO `province` VALUES (1,1,'北京'),(2,1,'上海'),(3,1,'重庆'),(4,1,'天津'),(5,1,'江苏'),(6,1,'河北省'),(8,1,'内蒙古'),(9,1,'山西省'),(10,1,'山东省'),(11,1,'安徽省'),(12,1,'福建省'),(13,1,'江西省'),(14,1,'浙江省'),(15,1,'河南省'),(16,1,'湖北省'),(17,1,'湖南省'),(18,1,'广东省'),(19,1,'广西省'),(20,1,'海南省'),(21,1,'黑龙江省'),(22,1,'吉林省'),(23,1,'辽宁省'),(24,1,'甘肃省'),(25,1,'宁夏'),(26,1,'青海省'),(27,1,'陕西省'),(28,1,'新疆省'),(30,1,'贵州省'),(31,1,'四川省'),(32,1,'西藏'),(33,1,'云南省'),(34,1,'香港'),(35,1,'台湾'),(36,1,'澳门');
/*!40000 ALTER TABLE `province` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2011-05-07 12:04:29
